run/Costa2013_cluster/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    BACK
    {
        type            symmetry;
    }
    FRONT
    {
        type            symmetry;
    }
    FUELIN
    {
        type            fixedValue;
        value           uniform (0 0 6.2);
    }
    OUTLET
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    OXIN
    {
        type            fixedValue;
        value           uniform (0 0 48.1);
    }
    WALL
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
