run/Costa2013_cluster/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    BACK
    {
        type            symmetry;
    }
    FRONT
    {
        type            symmetry;
    }
    FUELIN
    {
        type            turbulentMixingLengthFrequencyInlet;
        mixingLength    0.1;
        value           uniform 1;
    }
    OUTLET
    {
        type            inletOutlet;
        inletValue      uniform 1;
        value           uniform 1;
    }
    OXIN
    {
        type            turbulentMixingLengthFrequencyInlet;
        mixingLength    0.1;
        value           uniform 1;
    }
    WALL
    {
        type            omegaWallFunction;
        value           uniform 1;
    }
}


// ************************************************************************* //
